["path":"site/blog/comparing-64-bit-numbers/index.html","content":"[[When Twitter introduced Snowflake, their new ID generator, they also introduced 64-bit IDs. At first, I didnt think much of this. When the Twitpocalypse occurred (Twitter IDs surpassing 32 bits), I updated DestroyTwitter to use floating point IDs instead of integer IDs. I figured with Snowflake that AS3s floating point class, Number, had me covered. I was wrong.], [It turns out AS3 doesnt support 64-bit numbers. To support Snowflake, I have to update DestroyTwitter to use string IDs instead of floating point IDs. A handful of problems arise because of this. For one, I must reformat DestroyTwitters local SQLite database to use TEXT columns instead of REAL. Also, string comparison doesnt exactly behave the same as number comparison. For example, 9 &gt; 1 because 9 comes after 1.], [To overcome this inconvenience, we need a more complex method of comparison than a simple &lt; or &gt;. We could left pad the string with zeros, but this is expensive in AS3 and impossible in SQLite. I prefer comparing the string lengths first, then the strings as numbers:], [Just like AS3, SQLite lacks support for 64-bit numbers. You would think the same comparison method in SQL syntax would work:], [It doesnt. AS3 and SQL differ in the way each handles conditions. In AS3, the conditions relate to each other. If the first condition is false, the second condition assumes the first condition is false. For example:], [really means], [SQL, on the other hand, treats each condition separately. It acts like this if it were in AS3:], [As a result, our SQL comparison must be a bit more explicit:], [Hopefully, AS3 and SQLite will support 64-bit floating point in the near future. Until then, well have to resort to workarounds like the ones above.]]"},,"path":"site/blog/dayone/index.html","content":"[[], [A few weeks ago, I tweeted about creating a private Twitter account to use as a journal. I dropped the idea after realizing that Twitter limits the number of viewable tweets to 3200. Cue Day One, a new OSX journal app. With a clean UI and simply gorgeous icon, the design alone sold me.], [], [Its desktop version ($9.99) utilizes a menubar window for quick and easy entries, and an accompanying iOS version ($0.99) syncs through Dropbox. Notifications appear throughout the day, reminding me to make an entry, which is just the motivation I need to keep with it. The only downside I see so far is the lack of a global hotkey. No worries, as its expected early April. Kudos to Paul Mayne on a job well-done.]]"},,"path":"site/blog/infinity-file/index.html","content":"[[ Ive recently become addicted to Fab.com, a Groupon-esque website for designy products. I made my first purchase this past week, the Infinity File by designer Barbara Flanagan. Its a modular desk-top organizer for anything from business cards to loose nick-nacks. I find it to be the perfect solution for small items that lie awkward in a drawer, but appear messy on the desk-top. Its made from a single sheet of metal and holds a good weight. My only gripe is that the vertical stacking shown in its product shots is very wobbly.]]"},,"path":"site/blog/jekyll/index.html","content":"[[Jekyll is a simple, blog aware, static site generator. It takes a template directory (representing the raw form of a website), runs it through Textile or Markdown and Liquid converters, and spits out a complete, static website suitable for serving with Apache or your favorite web server. This is also the engine behind GitHub Pages, which you can use to host your projects page or blog right here from GitHub.]]"},,"path":"site/blog/konami-code/index.html","content":"[[], [Sure, I could have spent tonight working on useful features for DestroyTwitter, but no, I wrote a KonamiCode. To use it, simply instantiate it with a stage and youre good to go.], [On a related note, I realized Ive been neglecting GitHub for months, but now Im back! I also plan to return to the experimentation game after reminiscing about my convex hull, delaunay triangulation, and voronoi studies at work today. When you develop apps all day, writing experiments can be a breath of fresh air, allowing a level of creativity you simply cant get with apps.]]"},,"path":"site/blog/letterpressed-indesign-icons/index.html","content":"[[Today, a few of my co-workers at Adobe handed out these letterpressed posters of InDesigns type icons, as holiday gifts. Anyone can appreciate the detail on this print, but those who know the process should be in awe. Im in love with it and just had to take a closer look. At 500%, the black ink looks like iron filings and the grey looks like one of my dogs dirty stuffed-animal toys! I was told the local printers simply wouldnt take the job because its too detailed, so they had it done in Santa Barbaradoesnt surprise me. Seeing it in person makes me wish I took letterpress classes in college when I had the chance.], [  ]]"},,"path":"site/blog/luminant_point_arrays/index.html","content":"[[], [My buddy Luke pointed me to this series by Stephan Tillmans entitled, Luminant Point Array. Each photo represents the turning-off phase of a different television. Im in love with them and would die to have one hanging on my wall.]]"},]